In [74]:
#13.pandas 3

In [75]:
# Concatenation,Joining and Merging

In [76]:
from pylab import plt,mpl
import pandas as pd
df1 = pd.DataFrame(['100','200','300','400'], index = ['a','b','c','d'],columns = ['A'])
df1

     A
a  100
b  200
c  300
d  400

In [77]:
df2 = pd.DataFrame(['200','150','50'], index = ['f','b','d'],columns = ['B'])
df2

     B
f  200
b  150
d   50

In [78]:
#Concatenation
df1.append(df2,sort=False)

     A    B
a  100  NaN
b  200  NaN
c  300  NaN
d  400  NaN
f  NaN  200
b  NaN  150
d  NaN   50

In [79]:
df1.append(df2,ignore_index=True,sort=False)

     A    B
0  100  NaN
1  200  NaN
2  300  NaN
3  400  NaN
4  NaN  200
5  NaN  150
6  NaN   50

In [80]:
pd.concat((df1,df2),sort=False)

     A    B
a  100  NaN
b  200  NaN
c  300  NaN
d  400  NaN
f  NaN  200
b  NaN  150
d  NaN   50

In [81]:
pd.concat((df1,df2),ignore_index=True,sort=False)

     A    B
0  100  NaN
1  200  NaN
2  300  NaN
3  400  NaN
4  NaN  200
5  NaN  150
6  NaN   50

In [82]:
#Join
df1.join(df2) #left join

     A    B
a  100  NaN
b  200  150
c  300  NaN
d  400   50

In [83]:
df2.join(df1)

     B    A
f  200  NaN
b  150  200
d   50  400

In [84]:
df1.join(df2,how='left')

     A    B
a  100  NaN
b  200  150
c  300  NaN
d  400   50

In [85]:
df1.join(df2,how='right')

     A    B
f  NaN  200
b  200  150
d  400   50

In [86]:
df1.join(df2,how='outer') #outer 联集，inner 交集

     A    B
a  100  NaN
b  200  150
c  300  NaN
d  400   50
f  NaN  200

In [87]:
df1.join(df2,how='inner')

     A    B
b  200  150
d  400   50

In [88]:
#一列一列加，leftjoin
df = pd.DataFrame()

In [89]:
df['A'] =df1['A']
df

     A
a  100
b  200
c  300
d  400

In [90]:
df['B'] = df2
df

     A    B
a  100  NaN
b  200  150
c  300  NaN
d  400   50

In [91]:
#字典建立会是联集
df = pd.DataFrame({'A':df1['A'],'B':df2['B']})
df

     A    B
a  100  NaN
b  200  150
c  300  NaN
d  400   50
f  NaN  200

In [92]:
#Merging
c = pd.Series([200,150,50],index = ['b','d','c'])
df1['C'] = c
df2['C'] = c

In [93]:
df1

     A      C
a  100    NaN
b  200  200.0
c  300   50.0
d  400  150.0

In [94]:
df2

     B      C
f  200    NaN
b  150  200.0
d   50  150.0

In [95]:
pd.merge(df1,df2)

     A      C    B
0  100    NaN  200
1  200  200.0  150
2  400  150.0   50

In [96]:
pd.merge(df1,df2,on='C')

     A      C    B
0  100    NaN  200
1  200  200.0  150
2  400  150.0   50

In [97]:
pd.merge(df1,df2,how = 'outer')

     A      C    B
0  100    NaN  200
1  200  200.0  150
2  300   50.0  NaN
3  400  150.0   50

In [98]:
pd.merge(df1,df2,left_on = 'A',right_on = 'B')

     A    C_x    B  C_y
0  200  200.0  200  NaN

In [99]:
pd.merge(df1,df2,left_on = 'A',right_on = 'B',how = 'outer')

     A    C_x    B    C_y
0  100    NaN  NaN    NaN
1  200  200.0  200    NaN
2  300   50.0  NaN    NaN
3  400  150.0  NaN    NaN
4  NaN    NaN  150  200.0
5  NaN    NaN   50  150.0

In [100]:
pd.merge(df1,df2,left_index = True,right_index = True)

     A    C_x    B    C_y
b  200  200.0  150  200.0
d  400  150.0   50  150.0

In [101]:
pd.merge(df1,df2,on = 'C',left_index = True,right_index = True)

     A      C    B
b  200  200.0  150
d  400  150.0   50

In [102]:
pd.merge(df1,df2,on = 'C',right_index = True)

     A      C    B
a  100    NaN  200
b  200  200.0  150
d  400  150.0   50

In [103]:
pd.merge(df1,df2,on = 'C',left_index = True)

     A      C    B
f  100    NaN  200
b  200  200.0  150
d  400  150.0   50

In [104]:
#Recap: Concatenation,Joining and Merging

In [105]:
df1 = pd.DataFrame({'a':range(6),'b':[5,3,6,9,2,4]},index =list('abcdef'))
df1

   a  b
a  0  5
b  1  3
c  2  6
d  3  9
e  4  2
f  5  4

In [106]:
df2 = pd.DataFrame({'c':range(4),'d':[10,20,30,40]},index = ['a','b','h','i'])
df2

   c   d
a  0  10
b  1  20
h  2  30
i  3  40

In [107]:
#pd.concat
df5 = pd.concat([df1,df2],axis = 1)
df5

G:\application\anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

     a    b    c     d
a  0.0  5.0  0.0  10.0
b  1.0  3.0  1.0  20.0
c  2.0  6.0  NaN   NaN
d  3.0  9.0  NaN   NaN
e  4.0  2.0  NaN   NaN
f  5.0  4.0  NaN   NaN
h  NaN  NaN  2.0  30.0
i  NaN  NaN  3.0  40.0

In [108]:
#join
df4 = df1.join(df2)
df4

   a  b    c     d
a  0  5  0.0  10.0
b  1  3  1.0  20.0
c  2  6  NaN   NaN
d  3  9  NaN   NaN
e  4  2  NaN   NaN
f  5  4  NaN   NaN

In [109]:
# merge
df3 = pd.merge(df1,df2,left_index = True,right_index = True)
df3

   a  b  c   d
a  0  5  0  10
b  1  3  1  20

In [112]:
#Performance Aspects
import numpy as np
data = np.random.standard_normal((100000,2))
data

array([[-0.74844852,  0.49415265],
       [-1.34997423,  0.2428273 ],
       [ 2.3121974 ,  1.0231488 ],
       ...,
       [-0.04310441,  0.3106296 ],
       [ 0.14033893,  0.38470532],
       [ 0.82828171, -0.72138773]])

In [113]:
data.nbytes

1600000

In [116]:
df = pd.DataFrame(data,columns = ['x','y'])
df.head()

          x         y
0 -0.748449  0.494153
1 -1.349974  0.242827
2  2.312197  1.023149
3 -2.024101 -0.377770
4 -0.665204 -0.079902

In [118]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 2 columns):
x    100000 non-null float64
y    100000 non-null float64
dtypes: float64(2)
memory usage: 1.5 MB

In [133]:
%time res = df['x'] + df['y']

Wall time: 994 µs

In [134]:
res[:3]

0   -0.254296
1   -1.107147
2    3.335346
dtype: float64

In [214]:
%time res = df.sum(axis = 1)

Wall time: 9.97 ms

In [215]:
res[:3]

0   -0.254296
1   -1.107147
2    3.335346
dtype: float64

In [225]:
%time res = np.sum(df,axis = 1)

Wall time: 6.98 ms

In [226]:
res[:3]

0   -0.254296
1   -1.107147
2    3.335346
dtype: float64

In [247]:
%time res = df.values.sum(axis = 1)

Wall time: 2 ms

In [249]:
res[:3]

array([-0.25429588, -1.10714694,  3.3353462 ])

In [285]:
%time res = np.sum(df.values,axis = 1)

Wall time: 2.96 ms

In [287]:
res[:3]

0   -0.254296
1   -1.107147
2    3.335346
dtype: float64

In [286]:
%time res = df.eval('x + y')

Wall time: 5.98 ms

In [288]:
res[:3]

0   -0.254296
1   -1.107147
2    3.335346
dtype: float64

In [291]:
%time res = df.apply(lambda row:row['x'] + row['y'],axis = 1)

Wall time: 2.06 s

In [292]:
res[:3]

0   -0.254296
1   -1.107147
2    3.335346
dtype: float64